uhnp/src/Catalogs/КлючиАналитикПланирования/КлючиАналитикПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикПланирования</name>
  <attributes>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыПланированияПотребностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ОбъектыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПотребностей</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПоставки</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаСтатейБюджетов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаСтатейБюджетовПоставки</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетовПоставки</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/АналитикаПланирования/АналитикаПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаПланирования</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </resources>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыПланированияПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ОбъектыПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПотребностей</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПоставки</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтатейБюджетов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтатейБюджетовПоставки</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетовПоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/КлючиАналитикПланирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ЗаменаДублейКлючейАналитики

Процедура ЗаменитьДублиКлючейАналитики() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка,
	|	ДанныеСправочника.ПометкаУдаления КАК ПометкаУдаления,
	|	Аналитика.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	Справочник.КлючиАналитикПланирования КАК ДанныеСправочника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаИсточника КАК ДанныеРегистра
	|		ПО ДанныеСправочника.Ссылка = ДанныеРегистра.КлючАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланирования КАК Аналитика
	|		ПО ДанныеСправочника.Этап = Аналитика.Этап
	|			И ДанныеСправочника.ОбъектПланирования = Аналитика.ОбъектПланирования
	|			И ДанныеСправочника.АналитикаСтруктуры = Аналитика.АналитикаСтруктуры
	|			И ДанныеСправочника.АналитикаНоменклатуры = Аналитика.АналитикаНоменклатуры
	|			И ДанныеСправочника.АналитикаПотребностей = Аналитика.АналитикаПотребностей
	|			И ДанныеСправочника.АналитикаПоставки = Аналитика.АналитикаПоставки
	|			И ДанныеСправочника.УсловиеОплаты = Аналитика.УсловиеОплаты
	|			И ДанныеСправочника.ДатаОперации = Аналитика.ДатаОперации
	|			И ДанныеСправочника.Валюта = Аналитика.Валюта
	|			И ДанныеСправочника.Цена = Аналитика.Цена
	|ГДЕ
	|	ДанныеРегистра.КлючАналитики ЕСТЬ NULL";
	
	// Сформируем соответствие ключей аналитики.
	СоответствиеАналитик = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СоответствиеАналитик.Вставить(Выборка.Ссылка, Выборка.КлючАналитики);
			
			Если Не Выборка.ПометкаУдаления Тогда
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Попытка
					СправочникОбъект.УстановитьПометкуУдаления(Истина, Ложь);
				Исключение
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;

		КонецЦикла;
		Исключения = Новый Массив;
		ОбщегоНазначенияОПК.ЗаменитьСсылки(СоответствиеАналитик);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
